In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('studentD3.csv')

In [3]:
df

   roll           name class  marks  age
0     1       John Doe  10th     85   16
1     2     Jane Smith  11th     92   17
2     3  Alice Johnson   9th     78   15
3     4      Bob Brown  12th     88   18
4     5   Emily Wilson  10th     90   16

In [7]:
descb = df['marks'].describe()

In [8]:
print(descb)

count     5.000000
mean     86.600000
std       5.458938
min      78.000000
25%      85.000000
50%      88.000000
75%      90.000000
max      92.000000
Name: marks, dtype: float64

In [9]:
gr1 = df.groupby('marks').describe()

In [10]:
print(gr1)

       roll                                     age                        \
      count mean std  min  25%  50%  75%  max count  mean std   min   25%
marks
78      1.0  3.0 NaN  3.0  3.0  3.0  3.0  3.0   1.0  15.0 NaN  15.0  15.0
85      1.0  1.0 NaN  1.0  1.0  1.0  1.0  1.0   1.0  16.0 NaN  16.0  16.0
88      1.0  4.0 NaN  4.0  4.0  4.0  4.0  4.0   1.0  18.0 NaN  18.0  18.0
90      1.0  5.0 NaN  5.0  5.0  5.0  5.0  5.0   1.0  16.0 NaN  16.0  16.0
92      1.0  2.0 NaN  2.0  2.0  2.0  2.0  2.0   1.0  17.0 NaN  17.0  17.0


        50%   75%   max
marks
78     15.0  15.0  15.0
85     16.0  16.0  16.0
88     18.0  18.0  18.0
90     16.0  16.0  16.0
92     17.0  17.0  17.0

In [13]:
gr2 = df.groupby('age')

In [14]:
gr2.groups

{15: [2], 16: [0, 4], 17: [1], 18: [3]}

In [15]:
adult = gr2.get_group(18)

In [17]:
adult

   roll       name class  marks  age
3     4  Bob Brown  12th     88   18

In [18]:
import seaborn as sns

In [19]:
df = sns.load_dataset('iris')

In [20]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [21]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [22]:
grp = df.groupby('species')

In [23]:
grp.groups

{'setosa': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49], 'versicolor': [50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99], 'virginica': [100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149]}

In [24]:
se = grp.get_group('setosa')
ve = grp.get_group('versicolor')
vi = grp.get_group('virginica')

In [25]:
se.shape

(50, 5)

In [26]:
ve.shape

(50, 5)

In [27]:
vi.shape

(50, 5)

In [28]:
se.describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000    50.000000
mean        5.00600     3.428000      1.462000     0.246000
std         0.35249     0.379064      0.173664     0.105386
min         4.30000     2.300000      1.000000     0.100000
25%         4.80000     3.200000      1.400000     0.200000
50%         5.00000     3.400000      1.500000     0.200000
75%         5.20000     3.675000      1.575000     0.300000
max         5.80000     4.400000      1.900000     0.600000

In [29]:
ve.describe()

       sepal_length  sepal_width  petal_length  petal_width
count     50.000000    50.000000     50.000000    50.000000
mean       5.936000     2.770000      4.260000     1.326000
std        0.516171     0.313798      0.469911     0.197753
min        4.900000     2.000000      3.000000     1.000000
25%        5.600000     2.525000      4.000000     1.200000
50%        5.900000     2.800000      4.350000     1.300000
75%        6.300000     3.000000      4.600000     1.500000
max        7.000000     3.400000      5.100000     1.800000

In [30]:
vi.describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        6.58800     2.974000      5.552000      2.02600
std         0.63588     0.322497      0.551895      0.27465
min         4.90000     2.200000      4.500000      1.40000
25%         6.22500     2.800000      5.100000      1.80000
50%         6.50000     3.000000      5.550000      2.00000
75%         6.90000     3.175000      5.875000      2.30000
max         7.90000     3.800000      6.900000      2.50000